---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailedDowngradeTeeToCross
source: html/33f867b9-f879-caab-a24a-5aee6c480b25.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailedDowngradeTeeToCross Property

Failed to upgrade tee type to cross type.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedDowngradeTeeToCross { get; }
```